In [4]:
from sklearn import datasets
import pandas as pd
import numpy as nmp
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
df=pd.read_excel('onedata.xlsx')

In [6]:
df.head(5)

   buyer  fruits  gender  value
0    ali   apple    male      2
1   noor   mango    male      3
2  wajid  orange  female      4
3  karim  banana    male      4

# Uisng pandas

In [9]:
pd.get_dummies(df,columns=['buyer','fruits','gender'],dtype=int,drop_first=True)

,value,buyer_karim,buyer_noor,buyer_wajid,fruits_banana,fruits_mango,fruits_orange,gender_male
0,2,0,0,0,0,0,0,1
1,3,0,1,0,0,1,0,1
2,4,0,0,1,0,0,1,0
3,4,1,0,0,1,0,0,1

# Using Scikit-Learn OneHotEncoder

In [11]:
from sklearn.preprocessing import OneHotEncoder

In [16]:
ohe=OneHotEncoder(drop='first',dtype=int,sparse_output=False)

In [29]:
df_tf=ohe.fit_transform(df[['buyer','fruits','gender']])

In [30]:
df_tf

array([[0, 0, 0, 0, 0, 0, 1],
       [0, 1, 0, 0, 1, 0, 1],
       [0, 0, 1, 0, 0, 1, 0],
       [1, 0, 0, 1, 0, 0, 1]])

In [ ]:
cols=ohe.get_feature_names_outS()

In [32]:
cols

array(['buyer_karim', 'buyer_noor', 'buyer_wajid', 'fruits_banana',
       'fruits_mango', 'fruits_orange', 'gender_male'], dtype=object)

In [ ]:
df_n=pd.DataFrame(data=df_tf,columns=cols)

In [41]:
df_n.head()

,buyer_karim,buyer_noor,buyer_wajid,fruits_banana,fruits_mango,fruits_orange,gender_male
0,0,0,0,0,0,0,1
1,0,1,0,0,1,0,1
2,0,0,1,0,0,1,0
3,1,0,0,1,0,0,1